[
  {
    "name": "Prof. Pedro Oromí Masoliver",
    "title": "",
    "institution": "Universidad de la Laguna (ULL), Tenerife",
    "imageUrl": "/cisa2025/images/people/pedro-y500.png",
    "description": "Dr. Pedro Oromí is a distinguished professor at the University of La Laguna (ULL) in Tenerife, Spain, specializing in entomology. His extensive research primarily focuses on the biodiversity and evolution of subterranean fauna, with a particular emphasis on the Canary Islands. Throughout his career, Professor Oromí has contributed significantly to the knowledge of the Canary Is. biodiversity and the understanding of cave-dwelling species and island biogeography. He has authored numerous scientific publications, including studies on the colonization and diversification of insect lineages on islands and the phylogeography of various arthropod species. His work has been instrumental in advancing the knowledge of island ecosystems and their unique evolutionary processes. At CISA 2025, Prof. Oromí will present a comprehensive review of the current knowledge on the arthropod biodiversity of the Canary Islands, sharing insights from his extensive research and highlighting the ecological significance of these unique species.",
    "link": "https://portalciencia.ull.es/unidades/2884/colaboracion/investigador/574991"
  },
  {
    "name": "Dra. Amrita Srivathsan",
    "title": "",
    "institution": "Museum für Naturkunde, Berlin",
    "imageUrl": "/cisa2025/images/people/amrita-y500.png",
    "description": "Dr. Amrita Srivathsan is a molecular ecologist specializing in biodiversity discovery and species interactions. She is currently a researcher at the Museum für Naturkunde, Berlin, where she develops innovative bioinformatics tools and applies cutting-edge sequencing technologies, such as Nanopore sequencing, to advance integrative taxonomy and our knowledge of species interactions. Her research focuses on integrating modern molecular tools to facilitate traditional taxonomic research and studying trace DNA to understand biology of discovered species. She has contributed significantly to large-scale DNA barcoding and metagenomic techniques, particularly in understudied and highly diverse ecosystems. At CISA 2025, Dr. Srivathsan will share insights from her groundbreaking work on understudied taxa, highlighting the potential of next-generation sequencing to revolutionize systematics and natural history research.",
    "link": "https://www.museumfuernaturkunde.berlin/en/museum/today/team/amrita.srivathsan"
  },
  {
    "name": "Dra. Lisa Pokorny",
    "title": "",
    "institution": "Royal Botanic Garden (RJB), Spanish National Research Council (CSIC), Madrid",
    "imageUrl": "/cisa2025/placeholder.svg?height=400&width=400",
    "description": "Dra. Lisa Pokorny is an evolutionary biologist and botanist specializing in macroevolutionary patterns of land plants. She is currently a researcher at the Royal Botanic Garden (RJB), part of the Spanish National Research Council (CSIC) in Madrid. Her research focuses on unraveling macroevolutionary patterns, particularly in land plants. She implements target capture sequencing approaches, such as Hyb-Seq, and utilizes high-performance computing (HPC) phylogenomic workflows to investigate plant evolution. Dra. Pokorny has contributed significantly to our understanding of plant diversification and evolutionary history, with numerous publications in leading scientific journals. At CISA 2025, she will share insights from her extensive research on plant macroevolution, highlighting the application of genomic tools in understanding plant diversity and evolution.",
    "link": "https://rjb.csic.es/personal-cientifico/lisa-pokorny/"
  },
  {
    "name": "Dra. Patricia Álvarez-Campos",
    "title": "",
    "institution": "Department of Biology, Universidad Autónoma de Madrid, Spain",
    "imageUrl": "/cisa2025/images/people/patricia-y500.png",
    "description": "Dra. Patricia Álvarez-Campos is an evolutionary biologist and zoologist specializing in the developmental biology, regeneration, and reproductive mechanisms of annelid worms. She is currently a tenured professor at the Universidad Autónoma de Madrid (UAM), where she conducts research on the biodiversity, systematics, and evolution of marine annelids, particularly within the family Syllidae. Her work integrates various methodologies, including morphological studies, molecular phylogenetics, and cutting-edge techniques such as single-cell transcriptomics, to explore the processes of reproduction and tissue regeneration in these organisms. At CISA 2025, Dra. Álvarez-Campos will deliver a special plenary talk aimed at the general public, where she will discuss the most striking aspects of her research and the fascinating biology of her target organisms. This presentation will offer attendees a unique insight into the world of annelid worms, highlighting their remarkable regenerative abilities and the evolutionary significance of these processes.",
    "link": "https://www.uam.es/Ciencias/Patricia-%C3%81lvarez-Campos/1446781503513.htm"
  }
]